#include <iostream>
#include "adjacencymatrix.h"


using namespace std;



/**************************************************************************************************************************
1. G(V,E), G=Graph图， V=Vertex顶点的集合, E=Edge边的集合 G1=(V1, {E1}); V1=(A,B,C,D); E1={(A,B). (B,C), (C,D)....}; 【无向边】 Edge
        G2=(V2, {E2}); V2=(A,B,C,D); E2={<A,B>, <B,C>...}; 【有向边也称弧】 Arc
2. 无向完全图： 有n(n-1)/2条边     有向完全图： 有n(n-1)条边   带权的图称为网
3. 图的五种存储方式： 1.邻接矩阵 2.邻接表 3.十字链表 4.邻接多重表 5.边集数组









***************************************************************************************************************************/





int main()
{



    cout << "Hello World!" << endl;
    return 0;
}

